snlkuharlocal/src/Catalogs/ШтрихКоды/ШтрихКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихКоды</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШК</name>
    <type>
      <types>EnumRef.ВидыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаМодификации</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматШК</name>
    <type>
      <types>EnumRef.ФорматыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКодGS1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/InformationRegisters/ДанныеДляОтправкиПочтовымУведомлением/ДанныеДляОтправкиПочтовымУведомлением.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеДляОтправкиПочтовымУведомлением</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ШтрихКоды</types>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРассылки</name>
    <type>
      <types>CatalogRef.ТипыРассылок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ФорматыШК/ФорматыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыШК</name>
  <enumValues>
    <name>ITF14</name>
  </enumValues>
  <enumValues>
    <name>EAN13</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ШтрихКоды/ObjectModule.bsl
// +++ {Кузнецов Сергей Владимирович [19.07.2023]
Перем ПроверяемыеРеквизиты;
// }Кузнецов Сергей Владимирович +++ [19.07.2023]

Процедура ПередЗаписью(Отказ)	
	// +++ {Кузнецов Сергей Владимирович [19.07.2023]
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
		ПроверяемыеРеквизиты = Новый Соответствие;       
		Если ЭтоНовый()  Тогда
			ПроверяемыеРеквизиты.Вставить("ЭтоНовый",Истина); 
		Иначе
			ПроверяемыеРеквизиты.Вставить("Наименование",Ссылка.Наименование);
			ПроверяемыеРеквизиты.Вставить("Владелец",Ссылка.Владелец);
			ПроверяемыеРеквизиты.Вставить("ТипШК",Ссылка.ТипШК);
			ПроверяемыеРеквизиты.Вставить("ШтВКоробе",Ссылка.ШтВКоробе);
		КонецЕсли;
	КонецЕсли;
	// }Кузнецов Сергей Владимирович +++ [19.07.2023]
	
	Если Ссылка.Наименование<>Наименование Тогда
		ДатаМодификации=ТекущаяДата();		
	КонецЕсли;
	
	// +++ {Кузнецов Сергей Владимирович [05.07.2023]
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
		Если ЭтоНовый() ИЛИ НЕ Ссылка.ШтВКоробе = ШтВКоробе ИЛИ НЕ Ссылка.ТипШК = ТипШК ИЛИ НЕ Ссылка.Наименование = Наименование Тогда
			Попытка
				ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.СкладТСД.НайтиПоНаименованию("Все",Истина), Ссылка);
			Исключение
				//	Сообщить("Не могу записать ШК: " + ОписаниеОшибки(), СтатусСообщения.Важное);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	// }Кузнецов Сергей Владимирович +++ [05.07.2023]
	
	Если Ссылка.Наименование<>Наименование Тогда
		ДатаМодификации=ТекущаяДата();		
	КонецЕсли;
	
	// Лобан 040913 +++ Добавление  ITF-14 и контроль за EAN13
	Если НЕ ОбменДанными.Загрузка Тогда
		//крохин начало 17.09.2013	
		
		// Кухарь А.Ю. 21.02.2024 начало
		//
		Если ВидШК=Перечисления.ВидыШК.Основной Тогда
			Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад  Тогда
				СообщитьИзМодуля("На складе основные ШК не редактируются !!!!");
				Отказ=Истина;		
			КонецЕсли; 
		КонецЕсли;		 
		//  Кухарь А.Ю.  21.02.2024 конец
		
		
		//если СтрДлина(Наименование) > 13 и НЕ ФорматШК=Перечисления.ФорматыШК.ITF14 тогда
		Если СтрДлина(Наименование) > 13 и ФорматШК=Перечисления.ФорматыШК.ITF14 тогда
			
		ИначеЕсли СтрДлина(Наименование) > 13 и НЕ ФорматШК=Перечисления.ФорматыШК.ITF14 тогда			
			//крохин конец 17.09.2013	
			#Если Клиент Тогда
				Сообщить("Неверный формат ШК. Для заведение ШК длиной 14 символов установите формат ITF-14");
			#КонецЕсли
			Отказ=Истина;
			Возврат ; 
			//Кухарь 04.10.16 начало
			//8ми значные ШК
		ИначеЕсли СтрДлина(Наименование)=8 тогда
			КС=КонтрольныйСимволEAN(Наименование,8);
			Если КС<>Прав(Наименование,1) Тогда
				#Если Клиент Тогда
					Сообщить("Не корректный контрольный символ ШК ! На тип ШК"+ТипШК+", На вид ШК "+ВидШК+", ШК: "+Наименование+", корректный ШК: "+Лев(Наименование,7)+КС,СтатусСообщения.Важное);
					Отказ=Истина;
					Возврат; 
				#КонецЕсли
			КонецЕсли;
			//Кухарь 04.10.16 конец
			
		Иначе
			//для EAN13 проверяем контрольный символ
			//Лобан +++ 091213
			//Обход проверки для ШК 9999999999999
			Если Наименование <> "9999999999999" тогда
				//Лобан --- 091213
				КС=КонтрольныйСимволEAN(Наименование,13);
				Если КС<>Прав(Наименование,1) Тогда
					#Если Клиент Тогда
						Сообщить("Не корректный контрольный символ ШК ! На тип ШК"+ТипШК+", На вид ШК "+ВидШК+", ШК: "+Наименование+", корректный ШК: "+Лев(Наименование,12)+КС,СтатусСообщения.Важное);
						Отказ=Истина;
						Возврат; 
					#КонецЕсли
				КонецЕсли;
				//Лобан +++ 091213
				//Обход проверки для ШК 9999999999999
			Иначе КонецЕсли;
			//Лобан --- 091213
		КонецЕсли;
		Если ФорматШК.Пустая() Тогда
			ФорматШК = Перечисления.ФорматыШК.EAN13;	
		КонецЕсли;
	КонецЕсли;
	// Лобан 040913 ---
	
	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	
	
	// нечаева 10,02,2022 ++
	//Если ПланыОбмена.ОбменССайтомТоварами.ЭтотУзел().Код="SNL"  ИЛИ  ТекСтрокаСоединения=СтрокаСоединенияСразрешеннымОбменом Тогда
	ТипУзла = ПараметрыСеанса.ТипУзла;
	Если ТипУзла=Перечисления.ТипУзлаИБ.УправляющееПодразделение тогда //ИЛИ ТипУзла=Перечисления.ТипУзлаИБ.Склад Тогда
		
		Выгружать=ПроцедурыОбменаССайтом.РегистрироватьИзмененияШКДляСайта(Ссылка,ЭтотОбъект);
		// нечаева 140422+++
		Если Выгружать  Тогда
			//нечаева 14042022 --
			попытка
				ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(ЭтотОбъект.Владелец,Отказ);
			исключение
			конецпопытки;
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////////
		ОписаниеИзменений = ""; ОписаниеСтарыхЗначений = "";
		Если ЭтоНовый() Тогда
			ОписаниеИзменений = "Создан штрих-код - " + СокрЛП(Наименование) + " с типом " + Строка(ТипШК) + ", для номенклатуры " + СокрЛП(Владелец.Наименование) + ", с кодом " + СокрЛП(Владелец.Код) + "";
			ДополнительныеСвойства.Вставить("ОписаниеИзменений", ОписаниеИзменений);
		ИначеЕсли ПометкаУдаления Тогда
			ОписаниеИзменений = "Помечен на удаление штрих-код - " + СокрЛП(Наименование) + " с типом " + Строка(ТипШК) + ", для номенклатуры " + СокрЛП(Владелец.Наименование) + ", с кодом " + СокрЛП(Владелец.Код) + "";
			ДополнительныеСвойства.Вставить("ОписаниеИзменений", ОписаниеИзменений);
		ИначеЕсли Наименование <> Ссылка.Наименование ИЛИ ТипШК <> Ссылка.ТипШК ИЛИ ВидШК <> Ссылка.ВидШК Тогда
			Если Наименование <> Ссылка.Наименование Тогда
				СтароеЗначение = СокрЛП(Ссылка.Наименование);
				НовоеЗначение = СокрЛП(Наименование);
			ИначеЕсли ТипШК <> Ссылка.ТипШК Тогда
				СтароеЗначение = Строка(Ссылка.ТипШК);
				НовоеЗначение = Строка(ТипШК);
			ИначеЕсли ВидШК <> Ссылка.ВидШК Тогда
				СтароеЗначение = Строка(Ссылка.ВидШК);
				НовоеЗначение = Строка(ВидШК);
			КонецЕсли;
			ОписаниеСтарыхЗначений = ", старое значение - " + СтароеЗначение + ", новое значение - " + НовоеЗначение;
			ОписаниеИзменений = "Изменён штрих-код - " + СокрЛП(Наименование) + " с типом " + Строка(ТипШК) + ", для номенклатуры " + СокрЛП(Владелец.Наименование) + ", с кодом " + СокрЛП(Владелец.Код)
			+ ОписаниеСтарыхЗначений;
			ДополнительныеСвойства.Вставить("ОписаниеИзменений", ОписаниеИзменений);
		КонецЕсли;
		////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
	конецЕсли;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если НЕ ОбменДанными.Загрузка Тогда		
		
		//Кухарь 04.10.16 начало
		//Если СтрДлина(СокрЛП(Наименование))<>13  Тогда
		Если СтрДлина(СокрЛП(Наименование))<>13 и СтрДлина(СокрЛП(Наименование))<>8  Тогда
			
			//Кухарь 04.10.16  конец
			
			//крохин начало 17.09.2013
			//теперь есть 14-значные ШК
			Если НЕ (ФорматШК = Перечисления.ФорматыШК.ITF14 И СтрДлина(СокрЛП(Наименование))=14) Тогда
				Сообщить("Длина ШК должна составлять 13 символов !",СтатусСообщения.Важное);	
				Отказ=Истина;	
			КонецЕсли;
			//крохин конец 17.09.2013
		Иначе
			Отказ=НЕ КонтрольДублейШК(ЭтотОбъект);		
		КонецЕсли;		
	КонецЕсли;	
	//Катаев+ 17/06/14
	Если Не Отказ Тогда
		УстановитьПолучателейИзмененийОбъектаВнешние(ЭтотОбъект);
	КонецЕсли;
	//Катаев- 17/06/14
	
	// +++ {Кузнецов Сергей Владимирович [19.07.2023]
	Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
		Если  ПроверяемыеРеквизиты["ЭтоНовый"] = Неопределено Тогда
			Если НЕ Наименование = ПроверяемыеРеквизиты["Наименование"] ИЛИ НЕ Владелец = ПроверяемыеРеквизиты["Владелец"]  
				ИЛИ НЕ ТипШК = ПроверяемыеРеквизиты["ТипШК"]  ИЛИ НЕ ШтВКоробе = ПроверяемыеРеквизиты["ШтВКоробе"] Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.СкладТСД.НайтиПоНаименованию("Все",Истина), Ссылка);
			КонецЕсли;
		Иначе
			ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.СкладТСД.НайтиПоНаименованию("Все",Истина), Ссылка); //Новый ШК
		КонецЕсли;
	КонецЕсли;
	// }Кузнецов Сергей Владимирович +++ [19.07.2023]
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Если ДополнительныеСвойства.Свойство("ОписаниеИзменений") Тогда
		ДополнительныеСвойства.Вставить("Объект", Ссылка);
		ДополнительныеСвойства.Вставить("ТипРассылки", Справочники.ТипыРассылок.ОповещенияОбИзмененииШтрихкодов);
		ДополнительныеРеквизиты = Новый Структура("Период", ТекущаяДата());
		РегистрыСведений.ДанныеДляОтправкиПочтовымУведомлением.СоздатьЗаписьДляОтправкиПочтовымСообщением(ДополнительныеСвойства, ДополнительныеРеквизиты);
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////////////////////////////////////
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)	
	Префикс=ПолучитьПрефиксНомеров(ЭтотОбъект);
КонецПроцедуры
